{
  "common": {
    "welcome": "BEM VINDO AO MEU PORTFÓLIO",
    "curriculum": "CURRÍCULO"
  },
  "banner": {
    "title": "Olá, meu nome é Kauã. Tenho experiência em",
    "rotating": [
      "Visão Computacional.",
      "Desenvolvimento fullstack.",
      "IA, Chatbots e LLMs."
    ],
    "bio": "Tenho 21 anos, progamo desde os 14, curso Engenharia de Software no Inatel e sou completamente apaixonado por tecnologia, inovação e desafios. Já trabalhei profissionalmente com Typescript, Express, Next, React, Tailwind, ShadCN, Vitest, Python, Flask, OpenCV, Docker, YOLO, Electron e outras ferramentas.",
    "callToAction": "Se você está procurando alguém comprometido, criativo e focado em entregar resultados de qualidade, eu estou à disposição para colaborar em seus projetos. Vamos construir algo incrível juntos! Entre em contato comigo através dos meus canais de comunicação. Até mais!",
    "videoUrl": "https://www.youtube.com/embed/s1xH0MOSWc4",
    "resume": "https://www.canva.com/design/DAG-TvNDRds/-WLmEb4MMIYiGq5Iu1WjYQ/view"
  },
  "skills": {
    "title": "Habilidades",
    "description": "Além de desenvolver aplicações desktop e projetos relacionados à visão computacional, LLMs, chatbots e I.A., sou desenvolvedor Fullstack!\nIsso significa que você pode contar comigo para desenvolver o Frontend e o Backend de sua aplicação e também para hospedá-la."
  },
  "projects": {
    "title": "Projetos",
    "categories": {
      "web_development": "Desenvolvimento Web",
      "computer_vision": "Visão Computacional",
      "mobile": "Mobile",
      "eletronic": "Eletrônica",
      "GUI": "Aplicações Desktop"
    },
    "tab": "Aba",
    "commingSoon": "Em breve",
    "openProject": "Abrir o projeto",
    "details": "Ver detalhes",
    "web_development": {
      "Judite": {
        "title": "Judite",
        "description": "Frontend & Backend",
        "explanation": "Judite é uma plataforma web criada para automatizar o atendimento de empresas, integrando WhatsApp, Messenger, Instagram Direct e Webchat por meio da API oficial da Meta. O sistema oferece respostas automáticas, mensagens agendadas, dashboard com métricas, gestão de contatos e configuração completa de agentes de I.A., incluindo personalidade, ferramentas e parâmetros de operação. A plataforma também suporta contexto dinâmico extraído de vídeos, sites, PDFs, Word ou texto livre, além de integrações com serviços externos como Correios, Google Sheets, Freshdesk, Brasil API e Asaas. O agente utiliza ainda um banco de dados vetorial, permitindo respostas mais contextuais, precisas e alinhadas aos produtos e serviços da empresa. Com arquitetura modular e práticas de DevOps, o Judite é uma solução escalável, eficiente e fácil de manter."
      },
      "Studybuddy": {
        "title": "Studybuddy",
        "description": "Frontend & Design"
      },
      "Açaí Delivery": {
        "title": "Açaí Delivery",
        "description": "Frontend & Delivery"
      },
      "Infrareport": {
        "title": "Infrareport",
        "description": "Frontend & Google Maps"
      },
      "iPhone 15 Pro": {
        "title": "iPhone 15 Pro",
        "description": "Frontend & 3D"
      },
      "Table manager": {
        "title": "Table manager",
        "description": "Frontend & Empresas"
      },
      "Save the planet": {
        "title": "Save the planet",
        "description": "Jogo & Entretenimento"
      },
      "PONG": {
        "title": "PONG",
        "description": "Jogo & Entretenimento"
      },
      "Team allocation": {
        "title": "Team allocation",
        "description": "Frontend & Empresas"
      },
      "Github search": {
        "title": "Github search",
        "description": "Frontend & API"
      },
      "Jogo da forca": {
        "title": "Jogo da forca",
        "description": "Jogo & Entretenimento"
      },
      "Studybuddy API": {
        "title": "Studybuddy API",
        "description": "Backend & REST API"
      },
      "Jogo da velha": {
        "title": "Jogo da velha",
        "description": "Jogo & Entretenimento"
      },
      "Infrareport API": {
        "title": "Infrareport API",
        "description": "Backend & REST API"
      },
      "Aparatus": {
        "title": "Aparatus",
        "description": "Frontend & Backend",
        "explanation": "Aparatus é um SaaS de agendamento para barbearias que utiliza um chatbot para marcar horários. Os pagamentos são realizados via Stripe e a autenticação é feita por meio de OAuth."
      },
      "Personagem 3D": {
        "title": "Personagem 3D",
        "description": "Frontend & 3D",
        "explanation": "Projeto web de personagem 3D com foco em visualização e configuração interativa, utilizando tecnologias modernas de frontend e renderização 3D."
      }
    },

    "computer_vision": {
      "Reconhecimento facial - HOG": {
        "title": "Reconhecimento facial - HOG",
        "description": "I.A. & HOG",
        "explanation": "Este projeto é uma interface gráfica desenvolvida que permite efetuar o reconhecimento de faces utilizando o método Histogram of Oriented Gradients (HOG). Ele consiste basicamente em uma rede neural já treinada que necessita de apenas uma foto de um rosto qualquer e, após realizar a leitura facial, define 128 pontos (landmarks) responsáveis por caracterizar aquele rosto. Após isso, basta abrir a webcam ou selecionar uma nova foto contendo esse rosto para que a I.A. o reconheça. O projeto foi desenvolvido utilizando Python, Tkinter, OpenCV e a biblioteca \"face_recognition\"."
      },
      "Detector RTSP": {
        "title": "Detector RTSP",
        "description": "Classificação e Detecção",
        "explanation": "O Detector RTSP é um software que transforma qualquer câmera de segurança em uma central de alarme por meio do protocolo RTSP. Ele utiliza um classificador em tempo real que identifica imagens como \"Incêndio\", \"Com pessoa\" ou \"Sem pessoa\". Caso o classificador identifique a presença de uma pessoa em algum frame, um segundo modelo — desta vez um detector — é acionado para confirmar essa presença. Se confirmada, um terceiro detector entra em ação para identificar se a pessoa está portando uma arma de fogo ou uma faca. Além disso, o sistema conta com detecção e classificação de incêndios. Quando um evento é detectado, uma mensagem é enviada automaticamente ao WhatsApp do usuário contendo a imagem exata do frame do evento. Todos os modelos foram treinados por mim, e toda a interface e o backend foram desenvolvidos utilizando HTML, CSS, JavaScript, Electron e Python."
      },
      "Paint visual": {
        "title": "Paint visual",
        "description": "I.A. & Design",
        "explanation": "Este projeto é uma versão simulada e simplificada do software Paint, controlada por gestos das mãos. O sistema detecta sinais feitos com a mão e permite desenhar nas cores verde, azul e vermelho, além de apagar desenhos já feitos. Ao levantar o dedo indicador junto com o dedo médio, o software entra em modo de seleção de cores. Ao levantar apenas o dedo indicador, o sistema entende que o usuário está desenhando na tela. A aplicação foi desenvolvida utilizando Python, OpenCV e Mediapipe."
      },
      "Move Vision": {
        "title": "Move Vision",
        "description": "I.A. & Entretenimento",
        "explanation": "Move Vision é um jogo de movimento corporal. O jogador acessa o jogo realizando um cadastro com usuário e senha e, após clicar em \"Play\", a câmera é ativada e dividida em uma matriz 3x3, onde cada célula representa uma posição possível. Em seguida, uma imagem e dois pontos são exibidos indicando a posição que o jogador deve ocupar. O jogador deve se ajustar à posição em menos de um segundo. As imagens mudam continuamente e, enquanto o jogador conseguir acompanhar corretamente a sequência de movimentos, ele acumula pontos. Ao errar uma posição, o jogador perde."
      },
      "CEPEG": {
        "title": "CEPEG",
        "description": "I.A. & Eletrônica",
        "explanation": "O CEPEG é um projeto desenvolvido para auxiliar empresas que utilizam Equipamentos de Proteção Individual (EPIs) em seus ambientes de trabalho. O sistema é dividido em três etapas: <br/>1ª Etapa – Teste cognitivo;<br/>2ª Etapa – Reconhecimento do funcionário;<br/>3ª Etapa – Reconhecimento dos EPIs.<br/>Na primeira etapa, o funcionário realiza um teste cognitivo desenvolvido em Python (Pygame), com o objetivo de verificar se está apto a executar atividades de risco. Na segunda etapa, ao registrar o ponto, o funcionário escolhe uma entre três formas de identificação: reconhecimento facial, biometria ou RFID. Na terceira e última etapa, o funcionário se posiciona em frente a uma câmera conectada ao sistema, que utiliza Inteligência Artificial (Machine Learning) para verificar se os EPIs estão sendo utilizados corretamente. O tempo médio de verificação é de aproximadamente 8 segundos. Caso os EPIs estejam corretos, uma catraca libera o acesso ao setor. Caso contrário, uma mensagem é enviada automaticamente ao WhatsApp do supervisor. O projeto inclui um site e uma GUI para cadastro de funcionários e setores, além de gráficos, tabelas, relatórios e imagens. Os dados do site são armazenados no Firebase e os da GUI no MySQL. O CEPEG foi eleito o melhor projeto na categoria Utilidades da Feira de Projetos de 2022 da Escola Técnica de Eletrônica Francisco Moreira da Costa, recebendo também uma premiação da Prefeitura Municipal."
      },
      "Identificador de sinais": {
        "title": "Identificador de sinais",
        "description": "I.A. & Detecção",
        "explanation": "Este projeto utiliza visão computacional para identificar sinais feitos com a mão, permitindo ao computador reconhecer os números de 1 a 5 quando gesticulados. A aplicação foi desenvolvida utilizando Python, OpenCV e Mediapipe."
      },
      "Face car": {
        "title": "Face Car",
        "description": "I.A. & Detecção",
        "explanation": "Face Car é um projeto desenvolvido pelo time TN1101 para a feira de projetos da Escola Técnica de Eletrônica Francisco Moreira da Costa. O sistema utiliza uma câmera instalada dentro do veículo que, por meio do método HOG, reconhece o rosto do proprietário e detecta rostos desconhecidos. Caso um rosto não autorizado permaneça no interior do veículo por mais de 10 segundos, o sistema identifica uma tentativa de furto e envia um sinal binário via USB para um Arduino, que aciona um relé para bloquear o veículo."
      },
      "Mouse visual": {
        "title": "Mouse visual",
        "description": "I.A. & Detecção",
        "explanation": "Este projeto utiliza visão computacional para identificar gestos com a mão e, a partir deles, controlar o cursor do mouse e realizar cliques. Ao levantar apenas o dedo indicador, o cursor é movimentado. Ao levantar o dedo indicador junto com o dedo médio, o sistema realiza o clique. A aplicação foi desenvolvida utilizando Python, OpenCV e Mediapipe."
      },
      "Controlador de volume visual": {
        "title": "Controlador de volume visual",
        "description": "I.A. & Detecção",
        "explanation": "Este projeto utiliza visão computacional para controlar o volume do computador por meio de gestos com a mão. O sistema mede a distância entre o dedo indicador e o polegar para aumentar ou diminuir o volume. A aplicação foi desenvolvida utilizando Python, OpenCV e Mediapipe."
      },
      "Matriz de homografia": {
        "title": "Matriz de homografia",
        "description": "Predição & Coordenadas",
        "explanation": "Este projeto consiste em uma interface gráfica desenvolvida em Python e Tkinter que facilita a utilização da matriz de homografia e do algoritmo RANSAC do OpenCV. A ferramenta permite estimar coordenadas geográficas, como latitude e longitude, a partir de entradas X e Y. A matriz de homografia é uma matriz 3x3 que, ao ser multiplicada por coordenadas em uma escala inicial, retorna uma estimativa em outra escala."
      },
      "AutoML": {
        "title": "AutoML",
        "description": "I.A. & Predição",
        "explanation": "Este projeto consiste em uma interface gráfica que utiliza AutoML com PyCaret para treinar automaticamente o melhor modelo possível para a predição de posições espaciais, como latitude e longitude, a partir de variáveis de entrada como X e Y."
      },
      "SAHI & YoloV8": {
        "title": "SAHI & YOLOv8",
        "description": "I.A. & Detecção",
        "explanation": "O projeto aborda o desafio do reconhecimento de pequenos objetos em aplicações de visão computacional. Utilizando o framework SAHI (Slicing Aided Hyper Inference), imagens grandes são divididas em partes menores, permitindo uma detecção mais precisa quando combinada com o YOLOv8."
      },
      "Interface YoloV8": {
        "title": "Interface YOLOv8",
        "description": "I.A. & Detecção",
        "explanation": "Este projeto consiste em uma interface gráfica que simplifica a utilização do YOLOv8, permitindo selecionar facilmente os objetos que devem ou não ser detectados por meio de checkboxes, sem a necessidade de lidar diretamente com configurações complexas em código."
      },
      "Reconhecimento facial": {
        "title": "Reconhecimento facial",
        "description": "I.A. & Reconhecimento",
        "explanation": "Interface gráfica que permite reconhecimento facial por imagens e webcam, além do cadastro de novos rostos e treinamento da inteligência artificial. Desenvolvido com Python, OpenCV, Haarcascade e Tkinter."
      },
      "IA Personal trainer": {
        "title": "I.A. Personal Trainer",
        "description": "I.A. & Detecção",
        "explanation": "Este projeto atua como um personal trainer automático. Utilizando inteligência artificial, o sistema calcula o ângulo do braço durante a execução do exercício de rosca bíceps e determina se o movimento está correto, além de contabilizar as repetições."
      },
      "Velocímetro": {
        "title": "Velocímetro",
        "description": "I.A. & Detecção",
        "explanation": "Este projeto utiliza uma câmera para monitorar a posição e a velocidade de veículos em rodovias, aplicando o algoritmo de matriz de homografia para estimar a velocidade dos automóveis."
      }
    },

    "mobile": {
      "Infrareport Mobile": {
        "title": "Infrareport Mobile",
        "description": "Mobile & Google Maps",
        "explanation": "Por acaso, já encontrou algum problema de infraestrutura na sua cidade enquanto caminhava na rua? Provavelmente, todo dia. Com a dificuldade que os cidadãos encontram de reportar tais problemas, torna-se difícil a localização dos problemas urbanos por parte da prefeitura. Foi pensando nisso que o Infrareport foi criado. A ideia é, por meio de um aplicativo mobile, permitir com que qualquer cidadão de qualquer cidade do Brasil reporte problemas de infraestrutura da sua cidade para a prefeitura de forma rápida e fácil utilizando a API do Google Maps para localizar as ocorrências."
      }
    },

    "eletronic": {
      "VSMeter": {
        "title": "VSMeter",
        "description": "Eletrônica & IoT",
        "explanation": "Este projeto consiste em uma roupa que mede o batimento cardíaco, oxigenação sanguínea, temperatura corporal, inclinação corporal e frequência respiratória com sensores com precisão entre 95% até 100% em comparação com sensores precisos. Além disso, nossa roupa manda a localização em tempo real do paciente para um site com uma incerteza de um raio de apenas 4 metros. Nosso projeto é uma proposta de resolução para o problema que o mundo passou em 2020 e em 2021: Dezenas, centenas, milhares de pessoas morrendo em casa, porque estavam sozinhas sem nenhum atendimento médico. O microcontrolador NodeMCU mandará as informações para a plataforma Ubidots que irá exibir os dados e irá fazer a análise das condições fisiológicas do paciente e se algum dado estiver fora do que é considerado saudável, uma ambulância é mandada até o local em que o paciente se encontra(pois o hospital terá acesso aos dados) e uma ligação é feita AUTOMATICAMENTE pelo site para os familiares da vítima, avisando sobre o local e horário do possível desmaio!"
      }
    },

    "GUI": {
      "Cadastro de clientes": {
        "title": "Cadastro de clientes",
        "description": "Desktop & Banco de dados",
        "explanation": "Este projeto consiste em uma aplicação desktop que permite qualquer pessoa gerenciar sua lista de clientes do seu negócio. A aplicação exibe, em uma tabela, os clientes cadastrados e permite deletar, pesquisar e inserir novos clientes na tabela. É extremamente intuitivo, leve e qualquer um pode usar!"
      },
      "Smarlink": {
        "title": "Smarlink",
        "description": "Chatbot & Redes",
        "explanation": "Orientei a equipe TN2105 da ETE FMC no desenvolvimento do projeto Smarlink, um projeto que permite acessar o roteador e obter um relatório dos dispositivos conectados via Whatsapp. Por meio de um chatbot, é possível obter informações como: nome do dispositivo, IP e MAC Address. O Smartlink é uma solução inovadora para gerenciar dispositivos conectados à rede doméstica de forma prática e eficiente."
      }
    }
  },
  "ui": {
    "buttons": {
      "curriculum": "CURRÍCULO"
    },
    "navbar": {
      "home": "Home",
      "projects": "Projetos",
      "feedbacks": "Feedbacks"
    }
  },
  "feedbacks": {
    "title": "Feedbacks",
    "showMore": "Mostrar todos",
    "showLess": "Mostrar menos",
    "comments": {
      "eduardoht": {
        "name": "Eduardo Henrique Teixeira, especialista em Sistemas e Doutorando no Instituto Nacional de Telecomunicações",
        "content": "Descobri o trabalho do Kauã através do LinkedIn, onde pude observar diversos projetos desenvolvidos por ele. Cada um desses projetos utilizava diferentes modelos e bibliotecas, me mostrando logo de inicio que ele é um profissional extremamente versátil. Depois que comecei a acompanhar seu trabalho mais de perto, percebi que ele não apenas possui um conhecimento das bibliotecas que utiliza, mas também é capaz de modificar seu funcionamento interno para alcançar os objetivos propostos com maior eficiência. Essa habilidade, incomum para alguém no início da universidade, destacou outras duas características excepcionais: sua persistência em buscar soluções muito além do que é ensinado em um curso de graduação e sua facilidade em absorver conhecimento de diversas fontes, indo além da instrução formal."
      },
      "davimoreira": {
        "name": "Davi Moreira, Head de Staffs e Growth Marketing no HackTown e CEO da Dejavi",
        "content": "Kauã é o cara que faz a diferença. Sempre disposto a ajudar e fácil de lidar, ele resolve qualquer problema com dedicação e criatividade. Quando algo dá errado, Kauã vai até o final para encontrar a solução, tornando tudo mais simples e eficaz. Com ele, tudo flui melhor e mais leve."
      },
      "jaineamaral": {
        "name": "Jaíne Amaral, fundadora da Plan Way e Head de operações do Hacktown",
        "content": "Kauã é movido por desafios. Sua dedicação e persistência inspiram e sua proatividade é destaque por onde passa. Em minha experiência de voluntariado com Kauã, ele desempenhou muito bem sua função de líder e coordenador de equipe com engajamento constante, adaptação aos cenários com muita inteligência e carisma."
      },
      "ojuliocode": {
        "name": "Júlio Juriolli, desenvolvedor de software da Leucotron",
        "content": "Kaua é um excelente profissional, com experiência em diversas tecnologias. Trabalhamos juntos e posso garantir que é excelente em aprender novas coisas e desenvolver projetos criativos. Ótimas habilidades em solução de problemas."
      }
    }
  }
}